Revit 2027 API
BuiltInFailures.PartMakerMethodForMergePartFailures.NeedTwoPartsToMerge Property
 Attempt to merge fewer than two parts. There must be at least two. No part will be produced.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NeedTwoPartsToMerge { get; }
Public Shared ReadOnly Property NeedTwoPartsToMerge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NeedTwoPartsToMerge {
	FailureDefinitionId^ get ();
}
static member NeedTwoPartsToMerge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace